Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/atdf/ATSAM4S4B.atdf
        <register caption="FIFO Memory Aperture0 254" name="HSMCI_FIFO254" offset="0x5F8" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="FIFO Memory Aperture0 255" name="HSMCI_FIFO255" offset="0x5FC" rw="RW" size="4">
          <bitfield caption="Data to Read or Data to Write" mask="0xFFFFFFFF" name="DATA"/>
        </register>
        <register caption="Receive Pointer Register" name="HSMCI_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="HSMCI_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="HSMCI_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="HSMCI_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="HSMCI_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="HSMCI_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="HSMCI_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="HSMCI_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="HSMCI_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="HSMCI_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="HSMCI_DTOR__DTOMUL">
        <value caption="DTOCYC" name="_1" value="0x0"/>
        <value caption="DTOCYC x 16" name="_16" value="0x1"/>
        <value caption="DTOCYC x 128" name="_128" value="0x2"/>
        <value caption="DTOCYC x 256" name="_256" value="0x3"/>
        <value caption="DTOCYC x 1024" name="_1024" value="0x4"/>
        <value caption="DTOCYC x 4096" name="_4096" value="0x5"/>
        <value caption="DTOCYC x 65536" name="_65536" value="0x6"/>
        <value caption="DTOCYC x 1048576" name="_1048576" value="0x7"/>
      </value-group>
      <value-group caption="" name="HSMCI_SDCR__SDCSEL">
        <value caption="Slot A is selected." name="SLOTA" value="0x0"/>
        <value caption="-" name="SLOTB" value="0x1"/>
        <value caption="-" name="SLOTC" value="0x2"/>
        <value caption="-" name="SLOTD" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMCI_SDCR__SDCBUS">
        <value caption="1 bit" name="_1" value="0x0"/>
        <value caption="4 bits" name="_4" value="0x2"/>
        <value caption="8 bits" name="_8" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__RSPTYP">
        <value caption="No response" name="NORESP" value="0x0"/>
        <value caption="48-bit response" name="_48_BIT" value="0x1"/>
        <value caption="136-bit response" name="_136_BIT" value="0x2"/>
        <value caption="R1b response type" name="R1B" value="0x3"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__SPCMD">
        <value caption="Not a special CMD." name="STD" value="0x0"/>
        <value caption="Initialization CMD: 74 clock cycles for initialization sequence." name="INIT" value="0x1"/>
        <value caption="Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command." name="SYNC" value="0x2"/>
        <value caption="CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line." name="CE_ATA" value="0x3"/>
        <value caption="Interrupt command: Corresponds to the Interrupt Mode (CMD40)." name="IT_CMD" value="0x4"/>
        <value caption="Interrupt response: Corresponds to the Interrupt Mode (CMD40)." name="IT_RESP" value="0x5"/>
        <value caption="Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly." name="BOR" value="0x6"/>
        <value caption="End Boot Operation. This command allows the host processor to terminate the boot operation mode." name="EBO" value="0x7"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__OPDCMD">
        <value caption="Push pull command." name="PUSHPULL" value="0"/>
        <value caption="Open drain command." name="OPENDRAIN" value="1"/>
      </value-group>
      <value-group caption="" name="HSMCI_CMDR__MAXLAT">
        <value caption="5-cycle max latency." name="_5" value="0"/>
        <value caption="64-cycle max latency." name="_64" value="1"/>
      </value-group>
